# Pandas: 
#### Pandas is an opensource data analysis library written in Python. leverages the power and speed of numpy to make data analysis and preprocessing easy for data scientist. It provides rich and highly robust data operations. Numpy written in C.

## Data structure in Pandas

#### Pandas has two main data structures that make working with data easy and intuitive:

### Series:

- A Series is like a list of values, but each value has a label, called an "index."
- Similar to single column of data with labeled rows.
- You can access values by their labels, making data retrieval quick and readable.

In [64]:
import pandas as pd

# Creating a Series
series = pd.Series([10, 20, 30], index=['A', 'B', 'C'])
print(type(series))
series

<class 'pandas.core.series.Series'>

A    10
B    20
C    30
dtype: int64

### DataFrame:

- A DataFrame is like a table with rows and columns, where each column is a Series.
- It can hold data of different types (e.g., text, numbers) in each column.
- DataFrames have both row and column labels, which makes it easier to access and manipulate data based on these labels.

In [65]:
import pandas as pd

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
print(type(data))
df = pd.DataFrame(data)
df

<class 'dict'>

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [66]:
type(df)

pandas.core.frame.DataFrame

In [67]:
pd.__version__

'2.2.3'

In [68]:
dict_new={
    "name":['Gaurav','Navin Sir','Harsh Bhaiya','Sushil'],
    "marks":[96,98,85,88],
    "city":['Gaya','Bengaluru','Jodhpur','Bikaner']
    
}

In [69]:
dframe=pd.DataFrame(dict_new)

In [70]:
dframe

           name  marks       city
0        Gaurav     96       Gaya
1     Navin Sir     98  Bengaluru
2  Harsh Bhaiya     85    Jodhpur
3        Sushil     88    Bikaner

In [71]:
#we can convert this data frame to any file format. Let's say we want to convert it into .csv
#index means row in general and column ko column hi bolte hain.
dframe.to_csv('office.csv',index=False)

In [72]:
dframe.head(2)

        name  marks       city
0     Gaurav     96       Gaya
1  Navin Sir     98  Bengaluru

In [73]:
dframe.tail(2)

           name  marks     city
2  Harsh Bhaiya     85  Jodhpur
3        Sushil     88  Bikaner

In [74]:
#it does a numerical analysis
dframe.describe()

           marks
count   4.000000
mean   91.750000
std     6.238322
min    85.000000
25%    87.250000
50%    92.000000
75%    96.500000
max    98.000000

In [75]:
#to read a csv file
flight_details=pd.read_csv('flight_details.csv');

In [76]:
flight_details

  flight_no  price destination
0    GS1234   9600        Gaya
1    NR1234   9800   Bengaluru
2    HB1234   8500     Jodhpur
3    SR1234   8800     Bikaner

In [77]:
flight_details['price']

0    9600
1    9800
2    8500
3    8800
Name: price, dtype: int64

In [78]:
flight_details['price'][2]=10000

C:\Users\gshar\AppData\Local\Temp\ipykernel_11464\3132491848.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  flight_details['price'][2]=10000

In [79]:
flight_details

  flight_no  price destination
0    GS1234   9600        Gaya
1    NR1234   9800   Bengaluru
2    HB1234  10000     Jodhpur
3    SR1234   8800     Bikaner

### to change the index of data frame

In [80]:
flight_details.index=['first','second','third','fourth']

In [81]:
flight_details

       flight_no  price destination
first     GS1234   9600        Gaya
second    NR1234   9800   Bengaluru
third     HB1234  10000     Jodhpur
fourth    SR1234   8800     Bikaner